---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.JoistSystemFixedSpacingParam
source: html/202a8c6a-f82f-d3e7-1f29-94f41d354e5f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.JoistSystemFixedSpacingParam Property

"Fixed Spacing"

## Syntax (C#)
```csharp
public static ForgeTypeId JoistSystemFixedSpacingParam { get; }
```